Autodesk.Revit.DB.IFC.IFCLinkPosition
IFC Link Position within the Host Document.
Since:
2026

Autodesk.Revit.DB.IFC.IFCLinkPosition.SurveyPoint
Link IFC Origin to Survey Point.

Autodesk.Revit.DB.IFC.IFCLinkPosition.ProjectBasePoint
Link IFC Origin to Project Base Point.

Autodesk.Revit.DB.IFC.IFCLinkPosition.InternalOrigin
Link IFC Origin to Revit Internal Origin.